# System
brew "mise"

# Cloud / Infrastructure 
brew "dotenvx/brew/dotenvx"
brew "go-task/tap/go-task"
brew "vercel-cli"
brew "pulumi"
brew "graphviz"
brew "copier"
brew "glab"
brew "awscli"
cask "session-manager-plugin"
brew "azure-cli"
brew "cli53"
brew "helm"
tap "norwoodj/tap"
brew "helm-docs"
brew "docker"
brew "docker-compose"
cask "docker-desktop"
brew "k9s"
brew "kubernetes-cli"
brew "tflint"
brew "tfsec"
brew "terraform-docs"
tap "minamijoyo/tfupdate"
brew "minamijoyo/tfupdate/tfupdate"
brew "infracost"
tap "hashicorp/tap"
brew "hashicorp/tap/vault"
brew "podman"
brew "podman-compose"
cask "podman-desktop"
brew "dive"
brew "skopeo"
tap "common-fate/granted"
brew "granted"
brew "fx"
tap "turbot/tap"
brew "turbot/tap/steampipe"
tap "FairwindsOps/tap"
brew "FairwindsOps/tap/pluto"
tap "powershell/tap"
brew "powershell"
brew "youplot"

# Some dev stuff
brew "pnpm"
brew "poetry"
brew "go"
brew "eslint"
cask "dbeaver-community"
brew "libpq"
cask "pgadmin4"
cask "sequel-ace"
brew "sonar-scanner"
brew "cloc"
cask "ngrok"
cask "mongodb-compass"
brew "mongosh"
cask "bruno"
brew "ltex-ls"
brew "temporal"

# Git
brew "lazygit"
brew "git-lfs"
tap "gabrie30/utils"
brew "gabrie30/utils/ghorg"
brew "pre-commit"
brew "git-delta"
brew "gh"

# Browsers
cask "firefox"
cask "brave-browser"

# Fancy terminal utils
cask "wezterm"
brew "bat"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "diff-so-fancy"
brew "fzf"
brew "fd"
brew "gettext"
brew "jq"
brew "jless"
brew "pandoc"
brew "presenterm"
brew "ripgrep"
brew "stow"
brew "typst"
brew "wget"
brew "zsh"
brew "glow"
brew "httpie"
brew "watch"
brew "starship"
tap "shshemi/homebrew-tabiew"
brew "tabiew"
brew "zsh-vi-mode"
brew "renovate"
brew "gomplate"
brew "uv"
brew "imagemagick"
brew "dashlane/tap/dashlane-cli"

# Office & Communication
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "slack"
cask "obsidian"

# IDE
brew "tree-sitter-cli"
brew "neovim"

# ecommerce
brew "stripe/stripe-cli/stripe"

# AI
brew "rtk"
cask "claude-code"
cask "claude"
brew "anomalyco/tap/opencode"
